Revit 2027 API
OptionalFunctionalityUtils.IsDXFExportAvailable Method
 Checks whether the DXF Export functionality is available in the installed Revit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsDXFExportAvailable()
Public Shared Function IsDXFExportAvailable As Boolean
public:
static bool IsDXFExportAvailable()
static member IsDXFExportAvailable : unit -> bool
Return Value
Boolean
 True if the DXF Export functionality is available in the installed Revit.
Remarks
 DXF Export requires presence of certain modules that are optional and may not be part of the installed Revit.
See Also
Reference
OptionalFunctionalityUtils Class
Autodesk.Revit.DB Namespace